{
  "mainTitle": "Jongam-dong, Seongbuk-gu Food Finds: 3 Must-Try Korean Bossam Restaurants",
  "mainIntro": "Embrace the unique vibe of Jongam-dong, Seongbuk-gu, Korea with 3 standout Korean Bossam restaurants, paired with delightful stories and reviews.",
  "restaurants": [
    {
      "content": {
        "유덕족발": {
          "intro": "Dive into savory bliss! (유덕족발) - Pig trotters so tender, flavors explode!",
          "Review": "Craving an authentic Korean experience? Look no further than 유덕족발 (Yudeok Jokbal) at 서울 동대문구 홍릉로1길 38! This isn't your average pig's trotter; it's an edible masterpiece. From the moment you walk in, the aroma of spices and simmering broth wraps you in a warm, comforting embrace. The jokbal itself is cooked to perfection - the skin boasting a delightful chewiness while the meat melts in your mouth. But the magic doesn't stop there! 유덕족발 offers a symphony of banchan (side dishes) that perfectly complement the main attraction. Fresh kimchi, spicy radish salad, and tangy sauces elevate the meal to another level. Sharing a platter with friends is highly recommended – not just for the camaraderie, but because you'll want to try EVERYTHING! Honestly, this is Korean soul food at its finest. Get ready for a flavor adventure you won't soon forget. Your tastebuds will thank you. Seriously, go. Now. You can find them here: https://www.google.com/maps?q=37.5806030,127.0428043",
          "roadAddress": "서울 동대문구 홍릉로1길 38",
          "map": "https://www.google.com/maps?q=37.5806030,127.0428043",
          "latitude": 37.580603,
          "longitude": 127.0428043,
          "imgURL": "https://triptokorea.net/wp-content/uploads/2025/02/1.유덕족발.webp"
        }
      }
    },
    {
      "content": {
        "오봉집 성신여대점": {
          "intro": "Retro vibes meet spicy seafood! 오봉집 (Obongjip) 성신여대점: A taste of old Seoul with a modern twist!",
          "Review": "Step back in time and ignite your taste buds at Obongjip (오봉집 성신여대점)! Located at 서울 성북구 보문로 162 1층, this gem serves up authentic Korean seafood platters overflowing with flavor. Imagine tender octopus, spicy pork, and a symphony of savory side dishes, all presented in a charming, nostalgic atmosphere. The vintage decor and bustling energy transport you to a bygone era, while the modern flavors keep you hooked. Don't miss their signature *Obong Bossam* – it's a game-changer! Prepare for a satisfying and memorable Korean dining experience that's both delicious and Instagram-worthy. Obongjip isn't just a meal; it's a journey! Get ready to fall in love with this hidden treasure in the heart of Seoul.",
          "roadAddress": "서울 성북구 보문로 162 1층",
          "map": "https://www.google.com/maps?q=37.5889392,127.0169373",
          "latitude": 37.5889392,
          "longitude": 127.0169373,
          "imgURL": "https://triptokorea.net/wp-content/uploads/2025/02/2.오봉집-성신여대점.webp"
        }
      }
    },
    {
      "content": {
        "수제한방 고대왕족": {
          "intro": "Royal flavors await! (수제한방 고대왕족) Dive into traditional Korean cuisine.",
          "Review": "Step back in time and taste history at (korean - 수제한방 고대왕족), located at 서울 동대문구 안암로24길 5 1층. This isn't just a meal; it's an experience! The aroma of traditional herbs simmering with succulent pork fills the air the moment you walk in. Imagine tender, juicy jokbal (pig's trotters) infused with the earthy goodness of Korean medicinal herbs. Each bite is a symphony of flavors – savory, slightly sweet, and undeniably authentic. The textures are equally delightful, from the melt-in-your-mouth skin to the perfectly cooked meat. Forget your forks and knives; grab a lettuce wrap, add some spicy kimchi and savory ssamjang, and get ready for a flavor explosion! A must-try for any foodie seeking a truly memorable and traditional Korean meal.",
          "roadAddress": "서울 동대문구 안암로24길 5 1층",
          "map": "https://www.google.com/maps?q=37.5885760,127.0354604",
          "latitude": 37.588576,
          "longitude": 127.0354604,
          "imgURL": "https://triptokorea.net/wp-content/uploads/2025/02/3.수제한방-고대왕족.webp"
        }
      }
    }
  ]
}